//
//  OthersText.swift
//  vNUTS
//
//  Created by 間嶋大輔 on 2019/10/26.
//  Copyright © 2019 daisuke. All rights reserved.
//

import Foundation
struct OthersText {
    let magazinesHelp:[(String,String)] = [
("マガジンをつくる",
 "画面下部の「GENERATOR」をタップして、ご使用端末の写真ライブラリかカメラから顔のうつっている画像を選択します。AIが画像を判定し、画像にキャプションがつきます。\n"),
("マガジンの文字色を変える",
 "画面右上のColorボタンをタップすると、マガジンの文字色が変わります。色のパターンは、一つのマガジンにつき２パターンです。"),
("マガジンの文字の大きさ、位置を変える",
 "マガジン表紙の文字をタップすると、文字の大きさと位置を編集できます。\n文字をタップで選択したあと、ドラッグで移動します。\nピンチで拡大縮小します。\n 文字の選択を外すには、画像の文字以外の場所をタップします\nマガジン保存後は文字の編集、色変更ができません。GENERATOR画面でのみ編集できます。"),
("顔のパーツごとの分析ページをみる","画面右上の詳細ボタン（四角いページボタン）をタップすると、顔パーツごとのキャプションページに移動します"),
("複数人同時にマガジンを作成する","一枚の画像につき、３人まで同時にマガジンにできます。\n画像に４人以上の顔がうつっている場合、自動で３人が選ばれます。\n選ばれる顔を指定することはできません。余計な顔が映らないように、画像をトリミングしたり、カメラの背景に映り込まないように工夫してみてください。\n複数人のばあい、マガジンの文字をタップすると、そのキャプションの対象になっている顔が四角く強調表示されます。"),
("マガジンを保存する","画面左上の×ボタンをタップすると、マガジンを保存できます。\nアプリ内のギャラリー（マガジンラック）に保存するか、ご使用端末のフォトライブラリに保存するか選びます。\nアプリ内に保存したマガジンは、マガジンラックで見ることができます。\n保存しない場合は、キャンセルボタンを押すか、ポップアップメニューの外側をタップします。そのばあい、マガジンのデータは削除されます。"),
("SNSに投稿する","使用したいマガジンの右下のMOREボタン（・・・）をタップし、「別のアプリでシェア」メニューを選ぶと、マガジン画像のSNS投稿やメール送信などを選択できます\nこのアプリからは一枚ずつしか投稿できません。複数ページを投稿したい場合は、一旦フォトライブラリに保存し、投稿したいSNSのアプリから投稿してください。\n投稿メニューが出てこない場合は、ご使用端末の設定を確認するか、マガジン画像を一旦フォトライブラリに保存してから投稿してください。"),
("マガジンを削除する",
 "削除したいマガジンの右下のMOREボタン（・・・）をタップし、「削除」メニューを選択すると、マガジンを削除できます。マガジンのデータは画像を含め失われます。"),
("盛る","アプリのカメラは標準カメラですので、盛りたい場合は、別アプリで撮影、加工、フォトライブラリに保存してから、このアプリのジェネレーターにかけてください。"),
("マガジンの判定結果に納得がいかない","マガジンでつけられるキャプション文は、一枚の画像を元に任意のコンピュータプログラムが計算したものですので、客観的なものではありません。客観的な美しさや可愛さを判定するものではありません。あくまでたのしむためのフィクションです。画像の飾り付け、ぐらいに思ってください。判定ごとに結果が変わることも起こり得ます。どうしても文字列に納得がいかない場合は、表情を変えるなどして撮り直してみると、違う結果が出ることもあります。")]
    
let similHelp:[(String,String)] = [
("表情診断、トレーニング","アプリ起動時より、アプリはカメラから画像データを取得します。カメラにむかって、いろんな表情や角度をためしてみてください。"),
   ("診断結果が表示されない","カメラを前後にうごかすなどして、顔がフレームに収まるよう調整してください。"), ("トレーニングを録画する","中央下部の丸ボタンでスクリーンキャプチャを録画できます"),
("診断結果に納得がいかない","アプリで表示される「イケメン」は、画像を元にコンピュータープログラムが任意の計算をした結果です。客観的なものではありません。美しさ等とも関係ありません。アプリが高得点を出したからと言って、みんながそう思うわけではありません。話の種、程度のエンターテイメントとしてのフィクションです。また、表情や画質によって結果が変動することもあります。")
]
    
let termsOfService:[(String,String)] = [
("","アプリケーション「イケメン表情トレーニング」提供者DAISUKE MAJIMA（以下「提供者」といいます。）は、提供者が提供するスマートフォン用アプリケーション（以下「本アプリ」といいます。）の利用について、以下のとおり利用規約を定めます（以下「本規約」といいます。）。"),
("第１条　本規約への同意","１、本アプリの利用者（以下「利用者」といいます。）は、予め本規約に同意した上で本アプリを利用するものとします。\n２、利用者が、本サービスをスマートフォンその他の情報端末にダウンロードし、本規約への同意手続を行った時点で、利用者と提供者との間で、本規約の諸規定に従った利用契約が成立するものとします。\n３、利用者が未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、本サービスをご利用ください。\n４、未成年者の利用者が、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、本サービスに関する一切の法律行為を取り消すことは出来ません。\n５、本規約の同意時に未成年であった利用者が成年に達した後に本サービスを利用した場合、当該利用者は本サービスに関する一切の法律行為を追認したものとみなされます。"),
("第２条 規約の変更","１、提供者は、利用者の承諾を得ることなく、いつでも、本規約の内容を改定することができるものとし、利用者はこれを異議なく承諾するものとします。\n２、提供者は、本規約を改定するときは、その内容について提供者所定の方法（アプリプラットフォームを通したアップデート通知）により利用者に通知します。\n３、前本規約の改定の効力は、提供者が前項により通知を行った時点から生じるものとします。\n４、利用者は、本規約変更後、本サービスを利用した時点で、変更後の本利用規約に異議なく同意したものとみなされます。"),
("第３条　個人情報等の取り扱い","個人情報及び利用者情報については、提供者が別途定める「プライバシーポリシー」に則り、適正に取り扱うこととします。"),
("第４条　禁止行為","本サービスの利用に際し、提供者は、利用者に対し、次に掲げる行為を禁止します。提供者において、利用者が禁止事項に違反したと認めた場合、利用の一時停止、その他提供者が必要と判断した措置を取ることができます。\n\n（１）提供者または第三者の知的財産権を侵害する行為\n（２）提供者または第三者の名誉・信用を毀損または不当に差別もしくは誹謗中傷する行為\n（３）提供者または第三者の財産を侵害する行為、または侵害する恐れのある行為\n（４）提供者または第三者に経済的損害を与える行為\n（５）提供者または第三者に対する脅迫的な行為\n（６）コンピューターウィルス、有害なプログラムの使用またはそれを誘発する行為\n（７）法令または条例等に違反する行為\n（８）犯罪行為、犯罪行為に結びつく行為もしくはこれを助長する行為、またはその恐れのある行為\n（９）第三者の肖像権、著作権を侵害する行為\n（１０）上記の他、提供者が不適切と判断する行為\n\n利用者が前項に列挙された行為を行い提供者が損害を被った場合、その損害の全部または一部を利用者に負担していただくことがあります。"),
("第５条　免責","１、提供者は、本サービスの内容変更、中断、終了によって生じたいかなる損害についても、一切責任を負いません。\n２、提供者は、利用者の本サービスの利用環境について一切関与せず、また一切の責任を負いません。\n３、提供者は、本サービスが利用者の特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、利用者による本サービスの利用が利用者に適用のある法令または業界団体の内部規則等に適合すること、および不具合が生じないことについて、何ら保証するものではありません。\n４、提供者は、本サービスが全ての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末のＯＳのバージョンアップ等に伴い、本サービスの動作に不具合が生じる可能性があることにつき、利用者はあらかじめ了承するものとします。提供者は、かかる不具合が生じた場合に提供者が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。\n５、利用者は、AppStore、GooglePlay等のサービスストアの利用規約および運用方針の変更等に伴い、本サービスの一部又は全部の利用が制限される可能性があることをあらかじめ了承するものとします。\n６、提供者は、本サービスを利用したことにより直接的または間接的に利用者に発生した損害について、一切賠償責任を負いません。\n７、提供者は、利用者その他の第三者に発生した機会逸失、業務の中断その他いかなる損害（間接損害や逸失利益を含みます）に対して、提供者が係る損害の可能性を事前に通知されていたとしても、一切の責任を負いません。\n８、第１項乃至前項の規定は、提供者に故意または重過失が存する場合又は契約書が消費者契約法上の消費者に該当する場合には適用しません。\n９、前項が適用される場合であっても、提供者は、過失（重過失を除きます。）による行為によって利用者に生じた損害のうち、特別な事情から生じた損害については、一切賠償する責任を負わないものとします。\n１０、本サービスの利用に関し提供者が損害賠償責任を負う場合、当該損害が発生した月に利用者から受領した利用額を限度として賠償責任を負うものとします。\n１１、利用者と他の利用者との間の紛争及びトラブルについて、提供者は一切責任を負わないものとします。利用者と他の利用者でトラブルになった場合でも、両者同士の責任で解決するものとし、提供者には一切の請求をしないものとします。\n１２、利用者は、本サービスの利用に関連し、他の利用者に損害を与えた場合または第三者との間に紛争を生じた場合、自己の費用と責任において、かかる損害を賠償またはかかる紛争を解決するものとし、提供者には一切の迷惑や損害を与えないものとします。１３、利用者の行為により、第三者から提供者が損害賠償等の請求をされた場合には、利用者の費用（弁護士費用）と責任で、これを解決するものとします。提供者が、当該第三者に対して、損害賠償金を支払った場合には、利用者は、提供者に対して当該損害賠償金を含む一切の費用（弁護士費用及び逸失利益を含む）を支払うものとします。\n１４、利用者が本サービスの利用に関連して提供者に損害を与えた場合、利用者の費用と責任において提供者に対して損害を賠償（訴訟費用及び弁護士費用を含む）するものとします。\n１５、本アプリと上記説明文における「イケメン」は、任意の機械学習モデルがカメラ画像のピクセルを計算した結果の数値で、客観的な良否、美醜ではありません。本アプリ内のみで定義された「イケメン」であり、機械学習モデルの任意の「好み」であり、その他の意味合いにおけるイケメンではありません。利用者の外見についていかなる判断をもするものではありません。利用者は、あくまでエンターテイメントのジョークアプリとして利用するものとします。本アプリのコンテンツおよび診断結果によって利用者に生じたいかなる損害についても、提供者は一切責任を負いません。利用者は上記を理解の上利用するものとします。"),
("第６条 広告の掲載について","利用者は、本サービス上にあらゆる広告が含まれる場合があること、提供者またはその提携先があらゆる広告を掲載する場合があることを理解しこれを承諾したものとみなします。本サービス上の広告の形態や範囲は、提供者によって随時変更されます"),
("第７条　権利譲渡の禁止","１、利用者は、予め提供者の書面による承諾がない限り、本規約上の地位および本規約に基づく権利または義務の全部または一部を第三者に譲渡してはならないものとします。\n２、提供者は、本サービスの全部または一部を提供者の裁量により第三者に譲渡することができ、その場合、譲渡された権利の範囲内で利用者のアカウントを含む、本サービスに係る利用者の一切の権利が譲渡先に移転するものとします。"),
("第１１条　分離可能性","本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。"),
("第１２条　提供者への連絡方法","mail:samuraibrothersmail@gmail.com\nwebsite:https://tranquil-oasis-79483.herokuapp.com"),
("第１３条　準拠法、管轄裁判所","１、本規約の有効性，解釈及び履行については，日本法に準拠し，日本法に従って解釈されるものとします。\n２、提供者と利用者等との間での論議・訴訟その他一切の紛争については、訴額に応じて、東京簡易裁判所又は東京地方裁判所を専属的合意管轄裁判所とします｡"),
("","2019年11月1日施行")
    ]
    
let privacyPolicy:[(String,String)] = [
    ("","「イケメン表情トレーニング」提供者DAISUKE MAJIMA（以下「提供者」といいます。）は、提供者が提供するスマートフォン用アプリケーション（以下「本アプリ」といいます。）のにおけるプライバシー情報の取扱いについて、以下のとおりプライバシーポリシーを定めます。"),("",""),("取得する個人情報の種類","１、アプリケーション内で表情診断に利用するために、カメラでキャプチャした画像。\nおよび、上記画像から数値として計算、抽出した顔データ。\n２、広告表示のためにCookieデータやウェブビーコンを使用する場合があります。"),("個人情報の利用方法","１、画像データはアプリケーションのコンテンツ表示のための端末内での加工、画像ピクセル計算処理のために使用します。\n２、画像処理は利用者の端末内で行われ、ネットワーク通信による画像のアップロードは行いません。\n３、画像データおよび診断数値は、表情診断のためにのみアプリ内で一時的に保持、使用、保存されます。\n顔データのネットワーク通信によるアップロード、第三者への提供は行われません。\n４、ソフトウェアアップデートの通知をする場合があります。\n５、広告の表示のためcookieデータ等を使用する場合があります。\n６、法令に基づく場合、第三者の正当な利益を追求するために提供者が必要と判断した場合、個人情報を処理する場合があります。\n７、アプリケーション提供プラットフォームを通して、特定の個人と直接関連づけられることのない、アナリティクス等の統計データを取得することがあります。"),("第三者への開示について","提供者は、ユーザー情報のうち個人情報に関して、あらかじめユーザーの同意を得ることなく、第三者に提供しません。但し、次に定める場合にはこの限りではなく、ユーザー情報を第三者に提供することがあります。\n（２）国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して、提供者が協力する必要があり、かつユーザーからの同意取得が当該事務の遂行に支障を及ぼすおそれがある場合\n（３）その他法令で認められる場合"),("個人情報の開示","アプリケーション端末内で処理が完結するデータを除き、本人から個人情報の開示を求められた場合は、本人に対し開示します。"),("利用者関与の方法","アプリケーションによる利用者情報の利用停止を希望される場合は、アプリケーションをアンインストールしてください。\n当プライバシーポリシーの内容は、利用者の承諾を得ることなく、変更できるものとします。変更の通知はアプリケーション提供プラットフォームを通した通知の形で行い、変更後のプライバシーポリシーは、通知された時点から効力を生じるものとします。"),("お問い合わせ","mail:samuraibrothersmail@gmail.com\nwebsite:https://tranquil-oasis-79483.herokuapp.com"),
    ("","2020年2月1日施行")
    ]
}
